IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART1_UART1.xml
<module name="UART1_UART1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="UART1_DLL" acronym="UART1_DLL" offset="0x0" width="8" description="">
		<bitfield id="CLOCK_LSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit LSB divisor value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_RHR" acronym="UART1_RHR" offset="0x0" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RHR" width="8" begin="7" end="0" resetval="0x0" description="Receive holding register" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART1_THR" acronym="UART1_THR" offset="0x0" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="THR" width="8" begin="7" end="0" resetval="0x0" description="TRANSMIT HOLDING REGISTER" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART1_DLH" acronym="UART1_DLH" offset="0x4" width="8" description="">
		<bitfield id="CLOCK_MSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit MSB divisor value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_IER_CIR" acronym="UART1_IER_CIR" offset="0x4" width="8" description="">
		<bitfield id="NOT_USED2" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RW"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   TX_STATUS_IT_VALUE_0Disables the TX status interrupt.      1   |   TX_STATUS_IT_VALUE_1Enables the TX status interrupt.  " range="5" rwaccess="RW"/> 
		<bitfield id="NOT_USED1" width="1" begin="4" end="4" resetval="0x0" description="Not Defined" range="4" rwaccess="RW"/> 
		<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   RX_OVERRUN_IT_VALUE_0Disables the RX overrun interrupt.      1   |   RX_OVERRUN_IT_VALUE_1Enables the RX overrun interrupt.  " range="3" rwaccess="RW"/> 
		<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RX_STOP_IT_VALUE_0Disables the receive stop interrupt.      1   |   RX_STOP_IT_VALUE_1Enables the receive stop interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    0   |   THR_IT_VALUE_0Disables the THR interrupt.      1   |   THR_IT_VALUE_1Enables the THR interrupt.  " range="1" rwaccess="RW"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   RHR_IT_VALUE_0Disables the RHR interrupt.      1   |   RHR_IT_VALUE_1Enables the RHR interrupt.  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_IER_IRDA" acronym="UART1_IER_IRDA" offset="0x4" width="8" description="">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   EOF_IT_VALUE_0Disables the received EOF interrupt.      1   |   EOF_IT_VALUE_1Enables the received EOF interrupt.  " range="7" rwaccess="RW"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   LINE_STS_IT_VALUE_0Disables the receiver line status interrupt.      1   |   LINE_STS_IT_VALUE_1Enables the receiver line status interrupt.  " range="6" rwaccess="RW"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   TX_STATUS_IT_VALUE_0Disables the TX status interrupt.      1   |   TX_STATUS_IT_VALUE_1Enables the TX status interrupt.  " range="5" rwaccess="RW"/> 
		<bitfield id="STS_FIFO_TRIG_IT" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   STS_FIFO_TRIG_IT_VALUE_0Disables the status FIFO trigger level interrupt.      1   |   STS_FIFO_TRIG_IT_VALUE_1Enables the status FIFO trigger level interrupt.  " range="4" rwaccess="RW"/> 
		<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   RX_OVERRUN_IT_VALUE_0Disables the RX overrun interrupt.      1   |   RX_OVERRUN_IT_VALUE_1Enables the RX overrun interrupt.  " range="3" rwaccess="RW"/> 
		<bitfield id="LAST_RX_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   LAST_RX_BYTE_IT_VALUE_0Disables the last byte of frame in RX FIFO interrupt.      1   |   LAST_RX_BYTE_IT_VALUE_1Enables the last byte of frame in RX FIFO interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    0   |   THR_IT_VALUE_0Disables the THR interrupt.      1   |   THR_IT_VALUE_1Enables the THR interrupt.  " range="1" rwaccess="RW"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   RHR_IT_VALUE_0Disables the RHR interrupt.      1   |   RHR_IT_VALUE_1Enables the RHR interrupt.  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_IER_UART" acronym="UART1_IER_UART" offset="0x4" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="CTS_IT" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   CTS_IT_VALUE_0Disables the CTS* interrupt      1   |   CTS_IT_VALUE_1Enables the CTS* interrupt  " range="7" rwaccess="RW"/> 
		<bitfield id="RTS_IT" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   RTS_IT_VALUE_0Disables the RTS* interrupt      1   |   RTS_IT_VALUE_1Enables the RTS* interrupt  " range="6" rwaccess="RW"/> 
		<bitfield id="XOFF_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   XOFF_IT_VALUE_0Disables the XOFF interrupt      1   |   XOFF_IT_VALUE_1Enables the XOFF interrupt  " range="5" rwaccess="RW"/> 
		<bitfield id="SLEEP_MODE" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   SLEEP_MODE_VALUE_0Disables sleep mode      1   |   SLEEP_MODE_VALUE_1Enables sleep mode (stop baud rate clock when the module is inactive)  " range="4" rwaccess="RW"/> 
		<bitfield id="MODEM_STS_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   MODEM_STS_IT_VALUE_0Disables the modem status register interrupt      1   |   MODEM_STS_IT_VALUE_1Enables the modem status register interrupt  " range="3" rwaccess="RW"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   LINE_STS_IT_U_VALUE_0Disables the receiver line status interrupt      1   |   LINE_STS_IT_U_VALUE_1Enables the receiver line status interrupt  " range="2" rwaccess="RW"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    0   |   THR_IT_VALUE_0Disables the THR interrupt      1   |   THR_IT_VALUE_1Enables the THR interrupt  " range="1" rwaccess="RW"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   RHR_IT_VALUE_0Disables the RHR interrupt and time out interrupt.      1   |   RHR_IT_VALUE_1Enables the RHR interrupt and time out interrupt.  " range="0" rwaccess="RW"/>
	</register>
