IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART1_UART1.xml
	<register id="UART1_EFR" acronym="UART1_EFR" offset="0x8" width="8" description="">
		<bitfield id="AUTO_CTS_EN" width="1" begin="7" end="7" resetval="0x0" description="Auto-CTS enable bit. 0: Normal operation. 1: Auto-CTS flow control is enabled i.e. transmission is halted when the CTS* pin is high (inactive)." range="7" rwaccess="RW"/> 
		<bitfield id="AUTO_RTS_EN" width="1" begin="6" end="6" resetval="0x0" description="Auto-RTS enable bit. 0: Normal operation. 1: Auto- RTS flow control is enabled i.e. RTS* pin goes high (inactive) when the receiver FIFO HALT trigger level, TCR[3:0], is reached, and goes low (active) when the receiver FIFO RESTORE transmission trigger level is reached." range="6" rwaccess="RW"/> 
		<bitfield id="SPECIAL_CHAR_DETECT" width="1" begin="5" end="5" resetval="0x0" description="0: Normal operation. 1: Special character detect enable. Received data is compared with XOFF2 data. If a match occurs the received data is transferred to RX FIFO and IIR bit 4 is set to 1 to indicate a special character has been detected." range="5" rwaccess="RW"/> 
		<bitfield id="ENHANCED_EN" width="1" begin="4" end="4" resetval="0x0" description="Enhanced functions write enable bit. 0: Disables writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7. 1: Enables writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7." range="4" rwaccess="RW"/> 
		<bitfield id="SW_FLOW_CONTROL" width="4" begin="3" end="0" resetval="0x0" description="Combinations of Software flow control can be selected by programming bit 3 - bit 0. See Software Flow Control Options" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_FCR" acronym="UART1_FCR" offset="0x8" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_TRIG" width="2" begin="7" end="6" resetval="0x0" description="Sets the trigger level for the RX FIFO:If SCR[7] = 0 and TLR[7:4] = 0000:00:   8 characters01: 16 characters10: 56 characters11: 60 charactersIf SCR[7] = 0 and TLR[7:4] != 0000, RX_FIFO_TRIG is not considered.If SCR[7]=1, RX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1." range="7 - 6" rwaccess="WO"/> 
		<bitfield id="TX_FIFO_TRIG" width="2" begin="5" end="4" resetval="0x0" description="Sets the trigger level for the TX FIFO:If SCR[6] = 0 and TLR[3:0] = 0000:00:   8 spaces01: 16 spaces10: 32 spaces11: 56 spacesIf SCR[6] = 0 and TLR[3:0] != 0000, TX_FIFO_TRIG is not considered.If SCR[6]=1, TX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1" range="5 - 4" rwaccess="WO"/> 
		<bitfield id="DMA_MODE" width="1" begin="3" end="3" resetval="0x0" description="This register is considered if SCR[0] = 0.    Write0   |   DMA_MODE_VALUE_0DMA_MODE 0 (No DMA)      Write1   |   DMA_MODE_VALUE_1DMA_MODE 1 (UART_nDMA_REQ[0] in TX, UART_nDMA_REQ[1] in RX)  " range="3" rwaccess="WO"/> 
		<bitfield id="TX_FIFO_CLEAR" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Write0   |   TX_FIFO_CLEAR_VALUE_0No change      Write1   |   TX_FIFO_CLEAR_VALUE_1Clears the transmit FIFO and resets its counter logic to zero. Returns to zero after clearing FIFO.  " range="2" rwaccess="WO"/> 
		<bitfield id="RX_FIFO_CLEAR" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Write0   |   RX_FIFO_CLEAR_VALUE_0No change      Write1   |   RX_FIFO_CLEAR_VALUE_1Clears the receive FIFO and resets its counter logic to zero. Returns to zero after clearing FIFO.  " range="1" rwaccess="WO"/> 
		<bitfield id="FIFO_EN" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Write0   |   FIFO_EN_VALUE_0Disables the transmit and receive FIFOs. The transmit and receive holding registers are one byte FIFOs.      Write1   |   FIFO_EN_VALUE_1: Enables the transmit and receive FIFOs.The transmit and receive holding registers are 64-bytes FIFOs.  " range="0" rwaccess="WO"/>
	</register>
	<register id="UART1_IIR_CIR" acronym="UART1_IIR_CIR" offset="0x8" width="8" description="">
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    Read0   |   TX_STATUS_IT_VALUE_0TX status interrupt inactive      Read1   |   TX_STATUS_IT_VALUE_1TX status interrupt active  " range="5" rwaccess="RO"/> 
		<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   RX_OE_IT_VALUE_0RX overrun interrupt inactive      Read1   |   RX_OE_IT_VALUE_1RX overrun interrupt active  " range="3" rwaccess="RO"/> 
		<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   RX_STOP_IT_VALUE_0Receive stop interrupt inactive      Read1   |   RX_STOP_IT_VALUE_1Receive stop interrupt active  " range="2" rwaccess="RO"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   THR_IT_VALUE_0THR interrupt inactive      Read1   |   THR_IT_VALUE_1THR interrupt active  " range="1" rwaccess="RO"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   RHR_IT_VALUE_0RHR interrupt inactive      Read1   |   RHR_IT_VALUE_1RHR interrupt active  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_IIR_IRDA" acronym="UART1_IIR_IRDA" offset="0x8" width="8" description="">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    Read0   |   EOF_IT_VALUE_0Received EOF interrupt inactive      Read1   |   EOF_IT_VALUE_1Received EOF interrupt active  " range="7" rwaccess="RO"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    Read0   |   LINE_STS_IT_VALUE_0Receiver line status interrupt inactive      Read1   |   LINE_STS_IT_VALUE_1Receiver line status interrupt active  " range="6" rwaccess="RO"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    Read0   |   TX_STATUS_IT_VALUE_0TX status interrupt inactive      Read1   |   TX_STATUS_IT_VALUE_1TX status interrupt active  " range="5" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_IT" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read0   |   STS_FIFO_IT_VALUE_0Status FIFO trigger level interrupt inactive      Read1   |   STS_FIFO_IT_VALUE_1Status FIFO trigger level interrupt active  " range="4" rwaccess="RO"/> 
		<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   RX_OE_IT_VALUE_0RX overrun interrupt inactive      Read1   |   RX_OE_IT_VALUE_1RX overrun interrupt active  " range="3" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_LAST_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   RX_FIFO_LAST_BYTE_IT_VALUE_0Last byte of frame in RX FIFO interrupt inactive      Read1   |   RX_FIFO_LAST_BYTE_IT_VALUE_1Last byte of frame in RX FIFO interrupt active  " range="2" rwaccess="RO"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   THR_IT_VALUE_0THR interrupt inactive      Read1   |   THR_IT_VALUE_1THR interrupt active  " range="1" rwaccess="RO"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   RHR_IT_VALUE_0RHR interrupt inactive      Read1   |   RHR_IT_VALUE_1RHR interrupt active  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_IIR_UART" acronym="UART1_IIR_UART" offset="0x8" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="FCR_MIRROR" width="2" begin="7" end="6" resetval="0x0" description="Mirror the contents of FCR[0] on both bits." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="IT_TYPE" width="5" begin="5" end="1" resetval="0x0" description="Not Defined    Read0x00   |   IT_TYPE_VALUE_0Modem Interrupt. Priority=4      Read0x01   |   IT_TYPE_VALUE_1THR interrupt.  Priority=3      Read0x02   |   IT_TYPE_VALUE_2RHR interrupt.  Priority=2      Read0x03   |   IT_TYPE_VALUE_3Receiver line status error.  Priority=3      Read0x06   |   IT_TYPE_VALUE_6Rx timeout.  Priority=2      Read0x08   |   IT_TYPE_VALUE_8Xoff/Special character.  Priority=5      Read0x10   |   IT_TYPE_VALUE_10CTS, RTS, DSR change state from active (low) to inactive (high). Priority=6  " range="5 - 1" rwaccess="RO"/> 
		<bitfield id="IT_PENDING" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   IT_PENDING_VALUE_0An interrupt is pending      Read1   |   IT_PENDING_VALUE_1No interrupt is pending  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_LCR" acronym="UART1_LCR" offset="0xC" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DIV_EN" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   DIV_EN_VALUE_0Normal operating condition      1   |   DIV_EN_VALUE_1Divisor latch enable. Allows to access to DLL, DLH and other registers (refer to the registers mapping)  " range="7" rwaccess="RW"/> 
		<bitfield id="BREAK_EN" width="1" begin="6" end="6" resetval="0x0" description="Break control bit.    0   |   BREAK_EN_VALUE_0Normal operating condition.      1   |   BREAK_EN_VALUE_1Forces the transmitter output to go low to alert the communication terminal  " range="6" rwaccess="RW"/> 
		<bitfield id="PARITY_TYPE2" width="1" begin="5" end="5" resetval="0x0" description="Selects the forced parity format [if LCR[3] = 1]. If LCR[5] = 1 and LCR[4] = 0, the parity bit is forced to 1 in the transmitted and received data. If LCR[5] = 1 and LCR[4] = 1, the parity bit is forced to 0 in the transmitted and received data." range="5" rwaccess="RW"/> 
		<bitfield id="PARITY_TYPE1" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   PARITY_TYPE1_VALUE_0Odd parity is generated (if LCR[3] = 1)      1   |   PARITY_TYPE1_VALUE_1Even parity is generated (if LCR[3] = 1)  " range="4" rwaccess="RW"/> 
		<bitfield id="PARITY_EN" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   PARITY_EN_VALUE_0No parity      1   |   PARITY_EN_VALUE_1A parity bit is generated during transmission and the receiver checks for received parity.  " range="3" rwaccess="RW"/> 
		<bitfield id="NB_STOP" width="1" begin="2" end="2" resetval="0x0" description="Specifies the number of stop bits:    0   |   NB_STOP_VALUE_01 stop bits (word length = 5, 6, 7, 8)      1   |   NB_STOP_VALUE_11.5 stop bits (word length = 5) in USART mode. 2 stop bits (word length = 6, 7, 8)  " range="2" rwaccess="RW"/> 
		<bitfield id="CHAR_LENGTH" width="2" begin="1" end="0" resetval="0x0" description="Specifies the word length to be transmitted or received.    0x0   |   CHAR_LENGTH_VALUE_05 bits      0x1   |   CHAR_LENGTH_VALUE_16 bits      0x2   |   CHAR_LENGTH_VALUE_27 bits      0x3   |   CHAR_LENGTH_VALUE_38 bits  " range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_XON1_ADDR1" acronym="UART1_XON1_ADDR1" offset="0x10" width="8" description="">
		<bitfield id="XON_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON1 character in UART modes and ADDR1 address 1 for IrDA modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_MCR" acronym="UART1_MCR" offset="0x10" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Not Defined" range="7" rwaccess="RO"/> 
		<bitfield id="TCR_TLR" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   TCR_TLR_VALUE_0No action      1   |   TCR_TLR_VALUE_1Enables access to the TCR and TLR registers.  " range="6" rwaccess="RW"/> 
		<bitfield id="XON_EN" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   XON_EN_VALUE_0Disable 'XON any' function      1   |   XON_EN_VALUE_1Enable 'XON any' function  " range="5" rwaccess="RW"/> 
		<bitfield id="LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   LOOPBACK_EN_VALUE_0Normal operating mode      1   |   LOOPBACK_EN_VALUE_1Enable local loopback mode (internal). In this mode the MCR[3:0] signals are looped back into MSR[7:4]. The transmit output is looped back to the receive input internally  " range="4" rwaccess="RW"/> 
		<bitfield id="CD_STS_CH" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   CD_STS_CH_VALUE_0In loopback forces DCD* input high and IRQ outputs to inactive state.      1   |   CD_STS_CH_VALUE_1In loopback forces DCD* input low and IRQ outputs to inactive state.  " range="3" rwaccess="RW"/> 
		<bitfield id="RI_STS_CH" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RI_STS_CH_VALUE_0In loopback forces RI* input high.      1   |   RI_STS_CH_VALUE_1In loopback forces RI* input low.  " range="2" rwaccess="RW"/> 
		<bitfield id="RTS" width="1" begin="1" end="1" resetval="0x0" description="In loop back controls MSR[4].If auto-RTS is enabled the RTS* output is controlled by hardware flow control.    0   |   RTS_VALUE_0Force RTS* output to inactive (high).      1   |   RTS_VALUE_1Force RTS* output to active (low).  " range="1" rwaccess="RW"/> 
		<bitfield id="DTR" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   DTR_VALUE_0Force DTR* output to inactive (high).      1   |   DTR_VALUE_1Force DTR* output to active (low).  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_XON2_ADDR2" acronym="UART1_XON2_ADDR2" offset="0x14" width="8" description="">
		<bitfield id="XON_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON2 character in UART modes and ADDR2 address 2 for IrDA modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_LSR_CIR" acronym="UART1_LSR_CIR" offset="0x14" width="8" description="">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    Read0   |   THR_EMPTY_VALUE_0Transmit holding register (TX FIFO) is not empty      Read1   |   THR_EMPTY_VALUE_1Transmit hold register (TX FIFO) is empty. The transmission is not necessarily completed  " range="7" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="6" end="6" resetval="0x0" description="Not Defined" range="6" rwaccess="RO"/> 
		<bitfield id="RX_STOP" width="1" begin="5" end="5" resetval="0x0" description="The RX_STOP is generated based on the value set in the BOF Length register (EBLR). It is cleared on a single read of the LSR register    Read0   |   RX_STOP_VALUE_0Reception is on going or waiting for a new frame      Read1   |   RX_STOP_VALUE_1Reception is completed  " range="5" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   RX_FIFO_E_VALUE_0No data in the receive FIFO      Read1   |   RX_FIFO_E_VALUE_1At least one data character in the RX FIFO  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_LSR_IRDA" acronym="UART1_LSR_IRDA" offset="0x14" width="8" description="">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    Read0   |   THR_EMPTY_VALUE_0Transmit holding register (TX FIFO) is not empty      Read1   |   THR_EMPTY_VALUE_1Transmit hold register (TX FIFO) is empty. The transmission is not necessarily completed  " range="7" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_FULL" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    Read0   |   STS_FIFO_FULL_VALUE_0Status FIFO not full      Read1   |   STS_FIFO_FULL_VALUE_1Status FIFO full  " range="6" rwaccess="RO"/> 
		<bitfield id="RX_LAST_BYTE" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    Read0   |   RX_LAST_BYTE_VALUE_0The RX FIFO (RHR) does not contain the last byte of the frame to be read      Read1   |   RX_LAST_BYTE_VALUE_1The RX FIFO (RHR) contains the last byte of the frame to be read.This bit is only set when the last byte of a frame is available to be read. It is used to determine the frame boundary. It is cleared on a single read of the LSR register  " range="5" rwaccess="RO"/> 
		<bitfield id="FRAME_TOO_LONG" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read0   |   FRAME_TOO_LONG_VALUE_0No frame-too-long error in frame      Read1   |   FRAME_TOO_LONG_VALUE_1Frame-too-long error in the frame at the top of the STATUS FIFO, [next character to be read]. This bit is set to 1 when a frame exceeding the maximum length (set by RXFLH and RXFLL registers) has been received. When this error is detected, current frame reception is terminated. Reception is stopped until the next START flag is detected  " range="4" rwaccess="RO"/> 
		<bitfield id="ABORT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   ABORT_VALUE_0No abort pattern error in frame      Read1   |   ABORT_VALUE_1Abort pattern is received. SIR , MIR: Abort pattern. FIR: Illegal symbol  " range="3" rwaccess="RO"/> 
		<bitfield id="CRC" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   CRC_VALUE_0No CRC error in frame      Read1   |   CRC_VALUE_1CRC error in the frame at the top of the STATUS FIFO (next character to be read)  " range="2" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_E" width="1" begin="1" end="1" resetval="0x1" description="Not Defined    Read0   |   STS_FIFO_E_VALUE_0Status FIFO not empty      Read1   |   STS_FIFO_E_VALUE_1Status FIFO empty  " range="1" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   RX_FIFO_E_VALUE_0No data in the receive FIFO      Read1   |   RX_FIFO_E_VALUE_1At least one data character in the RX FIFO  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_LSR_UART" acronym="UART1_LSR_UART" offset="0x14" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_STS" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    Read0   |   RX_FIFO_STS_VALUE_0Normal operation      Read1   |   RX_FIFO_STS_VALUE_1At least one parity error, framing error or break indication in the RX FIFO. Bit 7 is cleared when no more errors are present in the RX FIFO.  " range="7" rwaccess="RO"/> 
		<bitfield id="TX_SR_E" width="1" begin="6" end="6" resetval="0x1" description="Not Defined    Read0   |   TX_SR_E_VALUE_0Transmitter hold (TX FIFO) and shift registers are not empty.      Read1   |   TX_SR_E_VALUE_1Transmitter hold (TX FIFO) and shift registers are empty  " range="6" rwaccess="RO"/> 
		<bitfield id="TX_FIFO_E" width="1" begin="5" end="5" resetval="0x1" description="Not Defined    Read0   |   TX_FIFO_E_VALUE_0Transmit hold register (TX FIFO) is not empty      Read1   |   TX_FIFO_E_VALUE_1Transmit hold register (TX FIFO) is empty. The transmission is not necessarily completed.  " range="5" rwaccess="RO"/> 
		<bitfield id="RX_BI" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read0   |   RX_BI_VALUE_0No break condition      Read1   |   RX_BI_VALUE_1A break was detected while the data being read from the RX FIFO was being received. (i.e. RX input was low for one character + 1 bit time frame).  " range="4" rwaccess="RO"/> 
		<bitfield id="RX_FE" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   RX_FE_VALUE_0No framing error in data being read from RX FIFO.      Read1   |   RX_FE_VALUE_1Framing error occurred in data being read from RX FIFO.(received data did not have a valid stop bit)  " range="3" rwaccess="RO"/> 
		<bitfield id="RX_PE" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   RX_PE_VALUE_0No parity error in data being read from RX FIFO.      Read1   |   RX_PE_VALUE_1Parity error in data being read from RX FIFO  " range="2" rwaccess="RO"/> 
		<bitfield id="RX_OE" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   RX_OE_VALUE_0No overrun error      Read1   |   RX_OE_VALUE_1Overrun error has occurred. Set when the character held in the receive shift register is not transferred to the RX FIFO. This case can occurs only when receive FIFO is full.  " range="1" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   RX_FIFO_E_VALUE_0No data in the receive FIFO      Read1   |   RX_FIFO_E_VALUE_1At least one data character in the RX FIFO  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_TCR" acronym="UART1_TCR" offset="0x18" width="8" description="">
		<bitfield id="RX_FIFO_TRIG_START" width="4" begin="7" end="4" resetval="0x0" description="RX FIFO trigger level to RESTORE transmission (0 - 60)" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="RX_FIFO_TRIG_HALT" width="4" begin="3" end="0" resetval="0x15" description="RX FIFO trigger level to HALT transmission (0 - 60)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_XOFF1" acronym="UART1_XOFF1" offset="0x18" width="8" description="">
		<bitfield id="XOFF_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF1 character in used in UART modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_MSR" acronym="UART1_MSR" offset="0x18" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="NCD_STS" width="1" begin="7" end="7" resetval="0x0" description="This bit is the complement of the DCD* input. In loop-back mode it is equivalent to MCR[3]" range="7" rwaccess="RO"/> 
		<bitfield id="NRI_STS" width="1" begin="6" end="6" resetval="0x0" description="This bit is the complement of the RI* input. In loop-back mode it is equivalent to MCR[2]" range="6" rwaccess="RO"/> 
		<bitfield id="NDSR_STS" width="1" begin="5" end="5" resetval="0x0" description="This bit is the complement of the DSR* input. In loop-back mode, it is equivalent to MCR[0]" range="5" rwaccess="RO"/> 
		<bitfield id="NCTS_STS" width="1" begin="4" end="4" resetval="0x0" description="This bit is the complement of the CTS* input. In loop-back mode it is equivalent to MCR[1]" range="4" rwaccess="RO"/> 
		<bitfield id="DCD_STS" width="1" begin="3" end="3" resetval="0x0" description="Indicates that DCD* input [or MCR[3] in loop back] has changed. Cleared on a read." range="3" rwaccess="RO"/> 
		<bitfield id="RI_STS" width="1" begin="2" end="2" resetval="0x0" description="Indicates that RI* input [or MCR[2] in loop back] has changed state from low to high. Cleared on a read." range="2" rwaccess="RO"/> 
		<bitfield id="DSR_STS" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read1   |   DSR_STS_VALUE_1Indicates that DSR* input (or MCR[0] in loop back) has changed state. Cleared on a read  " range="1" rwaccess="RO"/> 
		<bitfield id="CTS_STS" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read1   |   CTS_STS_VALUE_1Indicates that CTS* input (or MCR[1] in loop back) has changed state. Cleared on a read.  " range="0" rwaccess="RO"/>
	</register>
