IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART1_UART1.xml
	<register id="UART1_TLR" acronym="UART1_TLR" offset="0x1C" width="8" description="">
		<bitfield id="RX_FIFO_TRIG_DMA" width="4" begin="7" end="4" resetval="0x0" description="Receive FIFO trigger level" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="TX_FIFO_TRIG_DMA" width="4" begin="3" end="0" resetval="0x0" description="Transmit FIFO trigger level" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_XOFF2" acronym="UART1_XOFF2" offset="0x1C" width="8" description="">
		<bitfield id="XOFF_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF2 character in used in UART modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_SPR" acronym="UART1_SPR" offset="0x1C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SPR_WORD" width="8" begin="7" end="0" resetval="0x0" description="Scratchpad register" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_MDR1" acronym="UART1_MDR1" offset="0x20" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="FRAME_END_MODE" width="1" begin="7" end="7" resetval="0x0" description="IrDA mode only.    0   |   FRAME_END_MODE_VALUE_0Frame-length method      1   |   FRAME_END_MODE_VALUE_1Set EOT bit method  " range="7" rwaccess="RW"/> 
		<bitfield id="SIP_MODE" width="1" begin="6" end="6" resetval="0x0" description="MIR/FIR modes only.    0   |   SIP_MODE_VALUE_0Manual SIP mode: SIP is generated with the control of ACREG[3]      1   |   SIP_MODE_VALUE_1Automatic SIP mode: SIP is generated after each transmission.  " range="6" rwaccess="RW"/> 
		<bitfield id="SCT" width="1" begin="5" end="5" resetval="0x0" description="Store and control the transmission    0   |   SCT_VALUE_0Starts the Infrared transmission as soon as a value is written to THR      1   |   SCT_VALUE_1Starts the Infrared transmission with the control of ACREG[2]. Note: before starting any transmission, there must be no reception on going.  " range="5" rwaccess="RW"/> 
		<bitfield id="SET_TXIR" width="1" begin="4" end="4" resetval="0x0" description="Used to configure the infrared transceiver.    0   |   SET_TXIR_VALUE_0No action if MDR2[7]=0. TXIR pin output is forced low if MDR2[7]=1      1   |   SET_TXIR_VALUE_1TXIR pin output is forced high (not dependant of MDR2[7] value).  " range="4" rwaccess="RW"/> 
		<bitfield id="IR_SLEEP" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   IR_SLEEP_VALUE_0IrDA/CIR sleep mode disabled      1   |   IR_SLEEP_VALUE_1IrDA/CIR sleep mode enabled  " range="3" rwaccess="RW"/> 
		<bitfield id="MODE_SELECT" width="3" begin="2" end="0" resetval="0x7" description="Not Defined    0x0   |   MODE_SELECT_VALUE_0UART 16x mode      0x1   |   MODE_SELECT_VALUE_1SIR mode      0x2   |   MODE_SELECT_VALUE_2UART 16x auto-baud      0x3   |   MODE_SELECT_VALUE_3UART 13x mode      0x4   |   MODE_SELECT_VALUE_4MIR mode      0x5   |   MODE_SELECT_VALUE_5FIR mode      0x6   |   MODE_SELECT_VALUE_6CIR mode      0x7   |   MODE_SELECT_VALUE_7Disable (default state)  " range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_MDR2" acronym="UART1_MDR2" offset="0x24" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SET_TXIR_ALT" width="1" begin="7" end="7" resetval="0x0" description="Provide alternate functionnality for MDR1[4] [SET_TXIR]    0   |   SET_TXIR_ALT_VALUE_0Normal mode      1   |   SET_TXIR_ALT_VALUE_1Alternate mode for SET_TXIR  " range="7" rwaccess="RW"/> 
		<bitfield id="IRRXINVERT" width="1" begin="6" end="6" resetval="0x0" description="Only for IR mode [IRDA &#38; CIR]Invert RX pin inside the module before the voting or sampling system logic of the infra red block. This will not affect the RX path in UART Modem modes.    0   |   IRRXINVERT_VALUE_0inversion is performed      1   |   IRRXINVERT_VALUE_1No inversion is performed  " range="6" rwaccess="RW"/> 
		<bitfield id="CIR_PULSE_MODE" width="2" begin="5" end="4" resetval="0x0" description="CIR Pulse modulation definition. It defines high level of the pulse width associated with a digit:    0x0   |   CIR_PULSE_MODE_VALUE_0Pulse width of 3 from 12 cycles      0x1   |   CIR_PULSE_MODE_VALUE_1Pulse width of 4 from 12 cycles      0x2   |   CIR_PULSE_MODE_VALUE_2Pulse width of 5 from 12 cycles      0x3   |   CIR_PULSE_MODE_VALUE_3Pulse width of 6 from 12 cycles  " range="5 - 4" rwaccess="RW"/> 
		<bitfield id="UART_PULSE" width="1" begin="3" end="3" resetval="0x0" description="UART mode only. Used to allow pulse shaping in UART mode.    0   |   UART_PULSE_VALUE_0normal UART mode      1   |   UART_PULSE_VALUE_1UART mode with a pulse shaping  " range="3" rwaccess="RW"/> 
		<bitfield id="STS_FIFO_TRIG" width="2" begin="2" end="1" resetval="0x0" description="Only for IR-IRDA mode.Frame Status FIFO Threshold select:    0x0   |   STS_FIFO_TRIG_VALUE_01 entry      0x1   |   STS_FIFO_TRIG_VALUE_14 entries      0x2   |   STS_FIFO_TRIG_VALUE_27 entries      0x3   |   STS_FIFO_TRIG_VALUE_38 entries  " range="2 - 1" rwaccess="RW"/> 
		<bitfield id="IRTX_UNDERRUN" width="1" begin="0" end="0" resetval="0x0" description="IRDA Transmission status interrupt.When the IIR[5] interrupt occurs, the meaning of the interrupt is :    Read0   |   IRTX_UNDERRUN_VALUE_0the last bit of the frame has been transmitted successfully without error.      Read1   |   IRTX_UNDERRUN_VALUE_1an underrun has occurred. The last bit of the frame has been transmitted but with an underrun error present. The bit is reset to '0' when the RESUME register is read.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_TXFLL" acronym="UART1_TXFLL" offset="0x28" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART1_SFLSR" acronym="UART1_SFLSR" offset="0x28" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED5" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="OE_ERROR" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read1   |   OE_ERROR_VALUE_1Overrun error in RX FIFO when frame at top of RX FIFO was received.  " range="4" rwaccess="RO"/> 
		<bitfield id="FRAME_TOO_LONG_ERROR" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read1   |   FRAME_TOO_LONG_ERROR_VALUE_1Frame-length too long error in frame at top of RX FIFO.  " range="3" rwaccess="RO"/> 
		<bitfield id="ABORT_DETECT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read1   |   ABORT_DETECT_VALUE_1Abort pattern detected in frame at top of RX FIFO  " range="2" rwaccess="RO"/> 
		<bitfield id="CRC_ERROR" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read1   |   CRC_ERROR_VALUE_1CRC error in frame at top of RX FIFO. top of RX FIFO = Next frame to be read from RX FIFO  " range="1" rwaccess="RO"/> 
		<bitfield id="RESERVED0" width="1" begin="0" end="0" resetval="0x0" description="Not Defined" range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_TXFLH" acronym="UART1_TXFLH" offset="0x2C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="TXFLH" width="5" begin="4" end="0" resetval="0x0" description="MSB register used to specify the frame length" range="4 - 0" rwaccess="WO"/>
	</register>
	<register id="UART1_RESUME" acronym="UART1_RESUME" offset="0x2C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESUME" width="8" begin="7" end="0" resetval="0x0" description="Dummy read to restart the TX or RX" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART1_RXFLL" acronym="UART1_RXFLL" offset="0x30" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length in reception" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART1_SFREGL" acronym="UART1_SFREGL" offset="0x30" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SFREGL" width="8" begin="7" end="0" resetval="0x0" description="LSB part of the frame length" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART1_RXFLH" acronym="UART1_RXFLH" offset="0x34" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="Not Defined" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="RXFLH" width="4" begin="3" end="0" resetval="0x0" description="MSB register used to specify the frame length in reception" range="3 - 0" rwaccess="WO"/>
	</register>
	<register id="UART1_SFREGH" acronym="UART1_SFREGH" offset="0x34" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="Not Defined" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="SFREGH" width="4" begin="3" end="0" resetval="0x0" description="MSB part of the frame length" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="UART1_UASR" acronym="UART1_UASR" offset="0x38" width="8" description="">
		<bitfield id="PARITY_TYPE" width="2" begin="7" end="6" resetval="0x0" description="00 => No Parity identified. 01 => Parity space. 10 => Even Parity. 11 => Odd Parity" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="BIT_BY_CHAR" width="1" begin="5" end="5" resetval="0x0" description="0 => 7 bits character identified. 1 => 8 bits character identified" range="5" rwaccess="RO"/> 
		<bitfield id="SPEED" width="5" begin="4" end="0" resetval="0x0" description="Used to report the speed identified. 00000 => No speed identified. 00001 => 115200 bauds. 00010 => 57600 bauds. 00011 => 38400 bauds. 00100 => 28800 bauds. 00101 => 19200 bauds. 00110 => 14400 bauds. 00111 => 9600 bauds. 01000 => 4800 bauds. 01001 => 2400 bauds. 01010 => 1200 bauds" range="4 - 0" rwaccess="RO"/>
	</register>
	<register id="UART1_BLR" acronym="UART1_BLR" offset="0x38" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_RESET" width="1" begin="7" end="7" resetval="0x0" description="Status FIFO reset. This bit is self-clearing" range="7" rwaccess="RW"/> 
		<bitfield id="XBOF_TYPE" width="1" begin="6" end="6" resetval="0x1" description="SIR xBOF select.    0   |   XBOF_TYPE_VALUE_00xFF      1   |   XBOF_TYPE_VALUE_10xC0  " range="6" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="6" begin="5" end="0" resetval="0x0" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="UART1_ACREG" acronym="UART1_ACREG" offset="0x3C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="PULSE_TYPE" width="1" begin="7" end="7" resetval="0x0" description="SIR pulse width select:    0   |   PULSE_TYPE_VALUE_03/16 of baud-rate pulse width      1   |   PULSE_TYPE_VALUE_11.6us  " range="7" rwaccess="RW"/> 
		<bitfield id="SD_MOD" width="1" begin="6" end="6" resetval="0x0" description="Primary output used to configure transceivers. Connected to the SD/MODE input pin of IrDA transceivers.    0   |   SD_MOD_VALUE_0SD pin is set to high      1   |   SD_MOD_VALUE_1SD pin is set to low  " range="6" rwaccess="RW"/> 
		<bitfield id="DIS_IR_RX" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   DIS_IR_RX_VALUE_0Normal operation (RX input automatically disabled during transmit but enabled outside of transmit operation).      1   |   DIS_IR_RX_VALUE_1Disables RX input (permanent state - independent of transmit).  " range="5" rwaccess="RW"/> 
		<bitfield id="DIS_TX_UNDERRUN" width="1" begin="4" end="4" resetval="0x0" description="It is recommended to disable TX FIFO underrun capability by masking corresponding underrun interrupt. When disabling underrun by setting ACREG[4]=1, garbage data is sent over TX line.    0   |   DIS_TX_UNDERRUN_VALUE_0Long stop bits cannot be transmitted, TX underrun is enabled      1   |   DIS_TX_UNDERRUN_VALUE_1Long stop bits can be transmitted, TX underrun is disabled  " range="4" rwaccess="RW"/> 
		<bitfield id="SEND_SIP" width="1" begin="3" end="3" resetval="0x0" description="MIR/FIR Modes only.Send Serial Infrared Interaction Pulse [SIP]If this bit is set during a MIR/FIR transmission, the SIP will be send at the end of it.This bit automatically gets cleared at the end of the SIP transmission.    0   |   SEND_SIP_VALUE_0No action      1   |   SEND_SIP_VALUE_1Send SIP pulse.  " range="3" rwaccess="RW"/> 
		<bitfield id="SCTX_EN" width="1" begin="2" end="2" resetval="0x0" description="Store and controlled TX start. When MDR1[5] = 1 and the LH writes 1 to this bit the TX state machine starts frame transmission. This bit is self-clearing." range="2" rwaccess="RW"/> 
		<bitfield id="ABORT_EN" width="1" begin="1" end="1" resetval="0x0" description="Frame Abort. The LH can intentionally abort transmission of a frame by writing 1 to this bit. Neither the end flag nor the CRC bits are appended to the frame.   If transmit FIFO is not empty and MDR1[5]=1, UART IrDA will start a new transfer with data of previous frame as soon as abort frame has been sent. Therefore, TX FIFO must be reset before sending an abort frame." range="1" rwaccess="RW"/> 
		<bitfield id="EOT_EN" width="1" begin="0" end="0" resetval="0x0" description="EOT [end of transmission] bit. The LH writes 1 to this bit just before it writes the last byte to the TX FIFO in set-EOT bit frame closing method. This bit automatically gets cleared when the LH writes to the THR [TX FIFO]." range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_SCR" acronym="UART1_SCR" offset="0x40" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_TRIG_GRANU1" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   RX_TRIG_GRANU1_VALUE_0DISABLES THE GRANULARITY OF 1 FOR TRIGGER RX LEVEL.      1   |   RX_TRIG_GRANU1_VALUE_1ENABLES THE GRANULARITY OF 1 FOR TRIGGER RX LEVEL.  " range="7" rwaccess="RW"/> 
		<bitfield id="TX_TRIG_GRANU1" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   TX_TRIG_GRANU1_VALUE_0DISABLES THE GRANULARITY OF 1 FOR TRIGGER TX LEVEL.      1   |   TX_TRIG_GRANU1_VALUE_1Enables the granularity of 1 for trigger TX level.  " range="6" rwaccess="RW"/> 
		<bitfield id="DSR_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   DSR_IT_VALUE_0DISABLES DSR* INTERRUPT.      1   |   DSR_IT_VALUE_1ENABLES DSR* INTERRUPT.  " range="5" rwaccess="RW"/> 
		<bitfield id="RX_CTS_DSR_WAKE_UP_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   RX_CTS_DSR_WAKE_UP_ENABLE_VALUE_0DISABLES THE WAKE UP INTERRUPT AND CLEARS SSR[1].      1   |   RX_CTS_DSR_WAKE_UP_ENABLE_VALUE_1Waits for a falling edge of pins RX, CTS* or DSR* to generate an interrupt  " range="4" rwaccess="RW"/> 
		<bitfield id="TX_EMPTY_CTL_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   TX_EMPTY_CTL_IT_VALUE_0Normal mode for THR interrupt (See UART mode interrupts table).      1   |   TX_EMPTY_CTL_IT_VALUE_1THE THR INTERRUPT IS GENERATED WHEN TX FIFO AND TX SHIFT REGISTER ARE EMPTY.  " range="3" rwaccess="RW"/> 
		<bitfield id="DMA_MODE_2" width="2" begin="2" end="1" resetval="0x0" description="Used to specify the DMA mode valid if SCR[0] = 1    0x0   |   DMA_MODE_2_VALUE_0DMA mode 0 (no DMA)      0x1   |   DMA_MODE_2_VALUE_1DMA mode 1 (UART_nDMA_REQ[0] in TX, UART_nDMA_REQ[1] in RX)      0x2   |   DMA_MODE_2_VALUE_2DMA mode 2 (UART_nDMA_REQ[0] in RX)      0x3   |   DMA_MODE_2_VALUE_3DMA mode 3 (UART_nDMA_REQ[0] in TX)  " range="2 - 1" rwaccess="RW"/> 
		<bitfield id="DMA_MODE_CTL" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   DMA_MODE_CTL_VALUE_0The DMA_MODE is set with FCR[3]      1   |   DMA_MODE_CTL_VALUE_1The DMA_MODE is set with SCR[2:1]  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_SSR" acronym="UART1_SSR" offset="0x44" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="Not Defined" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="DMA_COUNTER_RST" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   DMA_COUNTER_RST_VALUE_0The DMA counter will not be reset if the corresponding FIFO is reset (via FCR[1] or FCR[2])      1   |   DMA_COUNTER_RST_VALUE_1The DMA counter will be reset if corresponding FIFO is reset (via FCR[1] or FCR[2])  " range="2" rwaccess="RW"/> 
		<bitfield id="RX_CTS_DSR_WAKE_UP_STS" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   RX_CTS_DSR_WAKE_UP_STS_VALUE_0No falling edge event on RX, CTS* and DSR*      Read1   |   RX_CTS_DSR_WAKE_UP_STS_VALUE_1A falling edge occurred on RX, CTS* or DSR*  " range="1" rwaccess="RO"/> 
		<bitfield id="TX_FIFO_FULL" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   TX_FIFO_FULL_VALUE_0TX FIFO is not full      Read1   |   TX_FIFO_FULL_VALUE_1TX FIFO is full.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_EBLR" acronym="UART1_EBLR" offset="0x48" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EBLR" width="8" begin="7" end="0" resetval="0x0" description="IR-IRDA mode: This register allows to define up to 176 xBOFs, the maximum required by IrDA specification.IR-CIR mode: This register specifies the number of consecutive zeros to be received before generating the RX_STOP interrupt [IIR[2]].0x00: feature disabled.0x01: generate RX_STOP interrupt after receiving one zero bit....0xFF: generate RX_STOP interrupt after receiving 255 zero bits." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_MVR" acronym="UART1_MVR" offset="0x50" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme revision number of module" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Not Defined" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1858" description="Function revision number of module" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x8" description="Rtl revision number of module" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x6" description="Major revision number of the module." range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number of the module." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision number of the module." range="5 - 0" rwaccess="RO"/>
	</register>
