IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART1_UART1.xml
	<register id="UART1_SYSC" acronym="UART1_SYSC" offset="0x54" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="POWER MANAGEMENT REQ/ACK CONTROLREF: OCP DESIGN GUIDELINES VERSION 1.1    0x0   |   IDLEMODE_VALUE_0Force idle. An idle request is acknowledged unconditionally      0x1   |   IDLEMODE_VALUE_1No-idle. An idle request is never acknowledged.      0x2   |   IDLEMODE_VALUE_2Smart idle. Acknowledgement to an idle request is given based in the internal activity of the module.      0x3   |   IDLEMODE_VALUE_3reserved  " range="4 - 3" rwaccess="RW"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="WAKE UP FEATURE CONTROL    0   |   ENAWAKEUP_VALUE_0Wake up is disabled      1   |   ENAWAKEUP_VALUE_1Wake up capability is enabled  " range="2" rwaccess="RW"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset. Set this bit to 1 to trigger a module reset. This bit is automatically reset by the hardware. During reads it always returns a 0.    Write0   |   SOFTRESET_VALUE_0Normal mode      Write1   |   SOFTRESET_VALUE_1The module is reset  " range="1" rwaccess="WO"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x0" description="Internal OCP clock gating strategy    0   |   AUTOIDLE_VALUE_0Clock is running      1   |   AUTOIDLE_VALUE_1Automatic OCP clock gating strategy is applied, based on the OCP interface activity  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_SYSS" acronym="UART1_SYSS" offset="0x58" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Not Defined" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset Monitoring    Read0   |   RESETDONE_VALUE_0Internal Module Reset is ongoing      Read1   |   RESETDONE_VALUE_1Reset completed  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART1_WER" acronym="UART1_WER" offset="0x5C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EVENT_7_TX_WAKEUP_EN" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    0   |   EVENT_7_TX_WAKEUP_EN_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_7_TX_WAKEUP_EN_VALUE_1EVENT CAN WAKE UP THE SYSTEM: Event can be: THR_IT or TX_DMA request and/or TX_SATUS_IT  " range="7" rwaccess="RW"/> 
		<bitfield id="EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT" width="1" begin="6" end="6" resetval="0x1" description="Not Defined    0   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_1Event can wake up the system  " range="6" rwaccess="RW"/> 
		<bitfield id="EVENT_5_RHR_INTERRUPT" width="1" begin="5" end="5" resetval="0x1" description="Not Defined    0   |   EVENT_5_RHR_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_5_RHR_INTERRUPT_VALUE_1Event can wake up the system  " range="5" rwaccess="RW"/> 
		<bitfield id="EVENT_4_RX_ACTIVITY" width="1" begin="4" end="4" resetval="0x1" description="Not Defined    0   |   EVENT_4_RX_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_4_RX_ACTIVITY_VALUE_1Event can wake up the system  " range="4" rwaccess="RW"/> 
		<bitfield id="EVENT_3_DCD_CD_ACTIVITY" width="1" begin="3" end="3" resetval="0x1" description="Not Defined    0   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_1Event can wake up the system  " range="3" rwaccess="RW"/> 
		<bitfield id="EVENT_2_RI_ACTIVITY" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   EVENT_2_RI_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_2_RI_ACTIVITY_VALUE_1Event can wake up the system  " range="2" rwaccess="RW"/> 
		<bitfield id="EVENT_1_DSR_ACTIVITY" width="1" begin="1" end="1" resetval="0x1" description="Not Defined    0   |   EVENT_1_DSR_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_1_DSR_ACTIVITY_VALUE_1Event can wake up the system  " range="1" rwaccess="RW"/> 
		<bitfield id="EVENT_0_CTS_ACTIVITY" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    0   |   EVENT_0_CTS_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_0_CTS_ACTIVITY_VALUE_1Event can wake up the system  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART1_CFPS" acronym="UART1_CFPS" offset="0x60" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="CFPS" width="8" begin="7" end="0" resetval="0x105" description="System clock frequency prescaler at [12x multiple]. Examples for CFPS values are given in the table below.Target Freq [KHz] CFPS [decimal] Actual Freq[KHz] 30   133  30.08 32.75   122  32.79 36   111  36.04 36.7   109  36.69 38*   105  38.1 40   100  40 56.8   70  57.14* configured at reset to this valueNote: CFPS = 0 is not supported." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART1_RXFIFO_LVL" acronym="UART1_RXFIFO_LVL" offset="0x64" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
